       IDENTIFICATION DIVISION.
       PROGRAM-ID. PROGCOB11.
      ********************************
      * AREA DE COMENTARIOS - REMARKS
      * AUTHOR: RODSON NAZARIO
      * DATA: 27/07/2021
      * OBJETIVO: CALCULAR AREA
      * OPERADORES RELACIONAIS
      ********************************
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SPECIAL-NAMES.
           DECIMAL-POINT IS COMMA.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       77 WRK-LARGURA      PIC 9(03)V99 VALUES ZEROS.
       77 WRK-COMPRIMENTO  PIC 9(03)V99 VALUES ZEROS.
       77 WRK-AREA         PIC 9(03)V99 VALUES ZEROS.
       77 WRK-AREA-ED      PIC ZZ9,99 VALUES ZEROS.
       PROCEDURE DIVISION.
           DISPLAY 'LARGURA: '
            ACCEPT WRK-LARGURA FROM CONSOLE.
           DISPLAY 'COMPRIMENTO: '
            ACCEPT WRK-COMPRIMENTO FROM CONSOLE.

           DISPLAY '========================='.

           IF WRK-LARGURA > 0 AND WRK-COMPRIMENTO > 0
            COMPUTE WRK-AREA = (WRK-LARGURA * WRK-COMPRIMENTO)
            MOVE WRK-AREA TO WRK-AREA-ED
            DISPLAY 'AREA CALCULADA ' WRK-AREA-ED
           ELSE
            DISPLAY 'INFORMAR LARGURA E COMPRIMENTO'

           STOP RUN.
