       IDENTIFICATION DIVISION.
       PROGRAM-ID. PROGCOB01.
      ********************************
      * AREA DE COMENTARIOS - REMARKS
      * AUTHOR: RODSON NAZARIO
      * DATA: 27/07/2021
      * OBJETIVO: MOSTRAR A STRING HELLO WORD
      ********************************
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       PROCEDURE DIVISION.
           DISPLAY 'HELLO WORD'.
           STOP RUN.
